Clash Bot Workflow - Apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.create_team_step_function.data.aws_caller_identity.current: Reading...
data.aws_acm_certificate.issued: Reading...
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_event_publisher_exec_role-development]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.create_team_step_function.data.aws_region.current[0]: Reading...
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
aws_iam_role.create_team_lambda_exec: Refreshing state... [id=clash_bot_create_team_exec_role-development]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_event_handler_exec_role-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
data.aws_iam_policy_document.event_publisher_policy_document: Reading...
data.aws_iam_policy_document.event_publisher_policy_document: Read complete after 0s [id=2002712062]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
data.aws_iam_policy_document.create_team_policy_document: Reading...
data.aws_iam_policy_document.retrieve_team_policy_document: Reading...
data.aws_iam_policy_document.retrieve_team_policy_document: Read complete after 0s [id=1560313852]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
data.aws_iam_policy_document.create_team_policy_document: Read complete after 0s [id=1560313852]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
aws_iam_policy.create_team_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowCreateTeamPolicy-development]
aws_lambda_function.create_team_lambda: Refreshing state... [id=clash-bot-create-team-development]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher-development]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_event_publisher_exec_role-development-20231114032927127100000002]
aws_iam_role_policy_attachment.create_team_lambda_exec_policy: Refreshing state... [id=clash_bot_create_team_exec_role-development-20231117070359518300000001]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
data.aws_iam_policy_document.event_handler_policy_document: Reading...
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler-development]
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 0s [id=2287429511]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_event_handler_exec_role-development-20231114032927103900000001]
aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=5d76167c-6bd9-488d-aee8-c6d122a624c1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.retrieve_team_policy will be created
  + resource "aws_iam_policy" "retrieve_team_policy" {
      + arn         = (known after apply)
      + description = "Policy for the retrieve team lambda function."
      + id          = (known after apply)
      + name        = "ClashBotWorkflowRetrieveTeamPolicy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-workflow-development"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_iam_role.retrieve_team_lambda_exec will be created
  + resource "aws_iam_role" "retrieve_team_lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_retrieve_team_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "retrieve_team_lambda_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash_bot_retrieve_team_exec_role-development"
    }

  # aws_lambda_function.create_team_lambda will be updated in-place
  ~ resource "aws_lambda_function" "create_team_lambda" {
        id                             = "clash-bot-create-team-development"
      ~ last_modified                  = "2023-11-17T07:04:06.705+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/development/131/create-team.zip" -> "artifacts/development/147/create-team.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.event_handler_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_handler_lambda" {
        id                             = "clash-bot-event-handler-development"
      ~ last_modified                  = "2023-11-17T07:04:21.000+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/development/131/event-handler.zip" -> "artifacts/development/147/event-handler.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.event_publisher_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_publisher_lambda" {
        id                             = "clash-bot-event-publisher-development"
      ~ last_modified                  = "2023-11-17T07:02:47.000+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/development/131/event-publisher.zip" -> "artifacts/development/147/event-publisher.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.retrieve_team_lambda will be created
  + resource "aws_lambda_function" "retrieve_team_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-retrieve-team-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/147/retrieve-teams.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "clash-bot-workflow-development"
            }
        }
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "this" {
      ~ definition    = jsonencode(
            {
              - Comment = "Creates a Clash Bot team for a Discord Service if the user is able to."
              - StartAt = "CreateTeam"
              - States  = {
                  - CreateTeam = {
                      - End        = true
                      - OutputPath = "$.Payload"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-create-team-development"
                          - "Payload.$"  = "$"
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
        name          = "create-team-development"
        tags          = {
            "Name" = "create-team-development"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 4 to change, 0 to destroy.
aws_iam_policy.retrieve_team_policy: Creating...
aws_iam_role.retrieve_team_lambda_exec: Creating...
aws_lambda_function.create_team_lambda: Modifying... [id=clash-bot-create-team-development]
aws_lambda_function.event_publisher_lambda: Modifying... [id=clash-bot-event-publisher-development]
aws_iam_policy.retrieve_team_policy: Creation complete after 1s [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowRetrieveTeamPolicy-development]
aws_iam_role.retrieve_team_lambda_exec: Creation complete after 1s [id=clash_bot_retrieve_team_exec_role-development]
aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy: Creating...
aws_lambda_function.retrieve_team_lambda: Creating...
aws_iam_role_policy_attachment.retrieve_team_lambda_exec_policy: Creation complete after 0s [id=clash_bot_retrieve_team_exec_role-development-20231117212535732800000001]
aws_lambda_function.event_publisher_lambda: Modifications complete after 6s [id=clash-bot-event-publisher-development]
aws_lambda_function.create_team_lambda: Modifications complete after 7s [id=clash-bot-create-team-development]
aws_lambda_function.retrieve_team_lambda: Still creating... [10s elapsed]
aws_lambda_function.retrieve_team_lambda: Creation complete after 16s [id=clash-bot-retrieve-team-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifying... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Modifications complete after 0s [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
aws_lambda_function.event_handler_lambda: Modifying... [id=clash-bot-event-handler-development]
aws_lambda_function.event_handler_lambda: Modifications complete after 6s [id=clash-bot-event-handler-development]

Apply complete! Resources: 4 added, 4 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development"
event-handler-lambda-version = "$LATEST"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development"
event-publisher-lambda-version = "$LATEST"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*